vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
#if defined(USE_PIR)
    // 0x05 --> phat hien co doi tuong dang xam nhap bang cam bien PIR
    #define DetectingByPIR          0x05
#endif

//******************************************************************************
// Function Prototypes
//******************************************************************************
//functions that have been created and modified by dat_a3cbq91
void HardwareInit( void );
void ProcessNONZigBeeTasks(void);
void ProcessZigBeePrimitives(void);

//Node mang su dung ham SenOneByte de gui ban tin toi Router-EMB
void SendOneByte(BYTE data, WORD ClusterID);
void Send_STATUS(WORD ClusterID);

#if defined(USE_SHT10)
     
    //Node mang gan sensor SHT su dung ham nay de gui du lieu ve Router-EMB
    void Send_HTE_ToRouterEmboard(WORD HTE_Cluster);

    //Node mang gan sensor SHT su dung ham nay de lay du lieu tu sensorSHT
    void LoadSHT10(void);
#endif

#if defined(USE_PTC06)

    //Node mang gan sensor CMR su dung ham nay de gui dia chi MAC va do dai anh ve Router-EMB
//    void Send_MAC_ToRouterEmboard(WORD CMR_Cluster);
    
    //Node mang gan sensor CMR su dung ham nay de gui goi du lieu ve Router-EMB
    void Send_IMAGE_ToRouterEmboard(WORD CMR_Cluster);

    void Send_Packet_ToRouterEmboard(WORD CMR_Cluster, BYTE pk);
    //ham cai dat ban dau cho camera
    void Initphoto(void);

    //Node mang gan sensor CMR su dung ham nay de chup anh lay du lieu tu sensorCMR
    void Take_photo(void);
#endif

#ifdef USE_MINI_RADAR
    //Node mang gan sensor MW su dung ham nay de kiem tra da co ket noi voi MW chua?
    BOOL CheckMiniRadar(void);
#endif

//end by dat_a3cbq91

//created by Hoang Anh Son
#if defined (TRACE_ROUTE_SUPPORT)
    void SendRoutingTableToRouterEMB(void);
    void RouteDrawRequestToNextHop(BYTE MSB_dest_addr, BYTE LSB_dest_addr, BYTE NodeNumber, BYTE *pListOfNode);
    void RouteDrawReply(BYTE NodeNumber, BYTE *pListOfNode);
    //danglam
#endif
//end by Hoang Anh Son

extern void RemoveAllGroups(void);
extern BOOL LookupAPSAddress(LONG_ADDR *);
#if defined(I_SUPPORT_BINDINGS)
    extern void RemoveAllBindings(SHORT_ADDR);
#endif

//******************************************************************************
// Application Variables
//******************************************************************************
NETWORK_DESCRIPTOR  *currentNetworkDescriptor;
NETWORK_DESCRIPTOR  *NetworkDescriptor;
ZIGBEE_PRIMITIVE    currentPrimitive;
BYTE                orphanTries;

#ifdef I_SUPPORT_SECURITY
    extern KEY_VAL	KeyVal;
    #ifdef USE_EXTERNAL_NVM
        extern WORD trustCenterLongAddr;
        extern NETWORK_KEY_INFO plainSecurityKey[2];
    #else
        extern ROM LONG_ADDR trustCenterLongAddr;
    #endif
#endif

BYTE AllowJoin = SET;
extern NWK_STATUS nwkStatus;

//variables has modified by dat_a3cbq91
#if defined(USE_LED)
    WORD Led_Count = BLINK_LED_NOT_JOIN;
#endif

#if defined(USE_WARNING_LOW_POWER)
    WORD Energy_Level;//Luu tru ket qua do dien ap nguon @dat_a3cbq91
    BYTE NumberOfWarning = MaxNumberWarningLowPower;//So lan gui ban tin canh bao het nang luong, mac dinh la 2 lan.
#endif

#if defined(USE_MQ6_V1)
    WORD Mq6Signal;//Luu tru ket qua do tin hieu tu cam bien khoi MQ6 @dat_a3cbq91
    WORD ThresholdMQ6;//Bien nay cho phep tuy chinh nguong bao chay thong qua bo nhung
    WORD Threshold_0;//Bien luu gia tri nguong ban dau tuy thuoc vao moi truong

    BYTE k = 8;//bien nay duoc su dung de dem so lan do MQ6 tai moi thoi diem, mac dinh la 8 lan
    BYTE SET_MQ6_V1 = 1;
#endif

#if defined(USE_MQ6_V2)
    // trang thai: 0x02 --> phat hien co khoi
    #define DetectingSmoke          0x02
    BYTE CYCLE_MQ6 = 1 * ONE_MINUTE_VALUE;
    WORD Timer_MQ6 = 0;
    BYTE SET_MQ6_V2 = 1;
#endif

#if defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)
    WORD ADC_result;//Luu tru gia tri lay mau tu ADC module @dat_a3cbq91
#endif
    
#if defined(USE_SHT10)
    WORD humidity, temperature;//Luu tru gia tri do am, nhiet do lay tu SHT chua qua xu ly @dat_a3cbq91
    BYTE SHT_STATUS = 1;
#endif
#ifndef USE_SHT10
    BYTE SHT_STATUS = 2;
#endif
#if defined(USE_PTC06)
   WORD length_data;
   BYTE buffer[4000];
   BYTE PTC06_STATUS = 1;
#endif
#ifndef USE_PTC06
      BYTE PTC06_STATUS = 2;
#endif

#ifndef THEODOIDONGVAT
      BYTE CYCLE_SENDING_STATUS = 1;
#endif

#ifdef THEODOIDONGVAT
      BYTE CYCLE_SENDING_STATUS = 2;
#endif
    
#if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
    volatile BYTE StatusActor;//bien nay dung de nhan thong tin phan hoi tu mach dieu khien may bom.
                             //No cung chinh la du lieu se duoc gui toi bo nhung de xac nhan ket qua cua lenh dieu khien
#endif

//for sleep mode @by Hoang Anh Son
#if defined(USE_SAVE_ENERGY_MODE)
    //Cac tham so duoi day dung timer duoc dinh nghia theo TIMER_UNIT
    BYTE SLEEP_DURATION  = 48;//thoi gian ngu
    BYTE WAKE_DURATION = 6;// thoi gian danh thuc
    BYTE confirmCmd, pre_confirmCmd;
    BYTE SleepingState = CLEAR;//intil trang thai dang ngu
    BYTE WakingState = CLEAR;//trang thai thuc
    BYTE SleepingStateTimerFlag = CLEAR;//co dem khi ngu
    BYTE SendDataAfterSleep = CLEAR;
    void MCUSleep(void);
    void MCUWake(void);
#endif

/*
 * Bien nay cho phep tuy chinh chu ki gui thong tin xac nhan cua actor2 ve
 * Router-Emboar. Mac dinh la 20 phut gui mot lan.
 * Ngoai ra, bien nay cho phep tuy chinh chu ki gui du lieu nhiet do - do am ve
 * Router-EMB thong qua bo nhung khi nut mang o che do active. Mac dinh la 20
 * phut gui mot lan o che do active.
 */
#ifndef THEODOIDONGVAT
    WORD CYCLE_SENDING;
    WORD CYCLE_SENDING_5M;
    WORD TIME_SENDING_PACKET;//thoi gian gui 1 goi data anh
    BYTE COUNT_PACKET;//bien dem so goi gui cho 1 anh
#endif
/****trongkhanh**************************/
#ifdef CANHBAOCHAYRUNG
    WORD CYCLE_SENDING;
    WORD CYCLE_SENDING_5M;
#endif


//variable store state of device
#if defined(CHAMSOCLAN)
static union
{
    struct
    {
        WORD EnableGetDataHTE5M     : 1;
        WORD EnableGetDataHTE       : 1;//when timer complete, this flag is set to get humi - temp data from SHT sensor
        WORD HTE_Data_Ready         : 1;//when finished getting humi - temp data, this flag is set to be able to send data to RE.
        WORD EnableGetDataCMR       : 1;//when timer complete, this flag is set to get image data from CMR sensor
        WORD CMR_Data_Ready         : 1;//when finished getting CMR data, this flag is set to be able to send data to RE.
        WORD ActorAckReceive        : 1;//when receive confirm from control pump board, this flag is set to be able to send response to RE.

