vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
        WORD LowPowerWarning        : 1;//when voltage drop below specific value, this flag is set to be able to send warning to RE
        WORD CompleteADC            : 1;//this flag use to identify that conversion of MQ6 signal and voltage signal are completed

        WORD DeviceMode             : 1;//this flag demonstrate what status of device: Active mode =0 or Save Energy mode = 1.
        WORD Autocmr                : 1;//
        WORD EnablePingToRE         : 1;//this flag use to inform to RE that ACTOR 1 or ACTOR2 is existing
        WORD PrintNeighborTable     : 1;

        WORD Reservation            : 8;
    } bits;
    WORD Val;
} WSANFlags;
#elif defined(CANHBAOCHAYRUNG)
static union
{
    struct
    {
        WORD EnableGetDataHTE5M     : 1;//when timer complete 5fut, this flag is set to get humi-temp...
        WORD EnableGetDataHTE       : 1;//when timer complete, this flag is set to get humi - temp data from SHT sensor
        WORD HTE_Data_Ready         : 1;//when finished getting humi - temp data, this flag is set to be able to send data to RE.
        WORD EnableGetDataCMR       : 1;//when timer complete, this flag is set to get image data from CMR sensor
        WORD CMR_Data_Ready         : 1;//when finished getting CMR data, this flag is set to be able to send data to RE.
        WORD ActorAckReceive        : 1;//when receive confirm from control pump board, this flag is set to be able to send response to RE.

        WORD PrintNeighborTable     : 1;

        WORD OnTimeGetMQ6           : 1;//when system stability (5 min after start up), this device receive signal from MQ6
        WORD DisableGetThresMq6     : 1;//when complete getting threshold of warning fire, this flag is set
        WORD MQ6Warning             : 1;//when MQ6 detect smoke, this flag is set to be able to send warning to RE
        WORD LowPowerWarning        : 1;//when voltage drop below specific value, this flag is set to be able to send warning to RE
        WORD MQ6orVoltage           : 2;//this flag use to identify what signal is convert to digital
                                        //when we need to use both MQ6 sensor and monitor energy level
        WORD CompleteADC            : 1;//this flag use to identify that conversion of MQ6 signal and voltage signal are completed

        WORD DeviceMode             : 1;//this flag demonstrate what status of device: Active mode =0 or Save Energy mode = 1.
        WORD Autocmr                : 1;//
        WORD EnablePingToRE         : 1;//this flag use to inform to RE that ACTOR2 is existing

        WORD Reservation            : 3;
    } bits;
    WORD Val;
} WSANFlags;
#else
static union
{
    struct
    {
        WORD PrintNeighborTable     : 1;

        WORD MicrowaveDetecting     : 1;//when sensor Microwave detect something, this flag is set to be able to send warning to RE.
        WORD PIRDetecting           : 1;//when sensor PIR detect something, this flag is set to be able to send warning to RE.
        WORD MicrowaveState         : 1;//when MCU identify Microwave Device, this flag is set

        WORD LowPowerWarning        : 1;//when voltage drop below specific value, this flag is set to be able to send warning to RE
        WORD CompleteADC            : 1;//this flag use to identify that conversion of MQ6 signal and voltage signal are completed

        WORD DeviceMode             : 1;//this flag demonstrate what status of device: Active mode =0 or Save Energy mode = 1.

        WORD EnablePingToRE         : 1;//this flag use to inform to RE that ACTOR 1 or ACTOR2 is existing

        WORD EnableReceiveMW        : 1;//this flag use to enable receive warning from Microwave sensor.
        WORD EnableReceivePIR       : 1;//this flag use to enable receive warning from PIR sensor.

        WORD Reservation            : 6;
    } bits;
    WORD Val;
} WSANFlags;
#endif

//Other variable
float tempere=0, tempcurrent;// bien dung cho lay data
BYTE i;//bien i su dung nhu mot bien tam trong cac vong lap
BYTE data;
WORD j;//bien j su dung nhu mot bien tam trong cac vong lap
WORD TimerCount = 0;//bien dem so lan ngat Timer
DWORD timer = TIMER_UNIT;//every 1s, the timer32 bit interrupt again.

//end by dat_a3cbq91

//******************************************************************************
//******************************************************************************
//******************************************************************************
int main(void)
{
    /*******************************create by lab411****************************/
    OSCCON = 0x2001;//current osc HS, new osc FRC

    CLKDIV = 0x0000;//Fcy = Fosc/2

    /************Maping Pins************/
    //unlock registers
    asm volatile ("mov #OSCCONL, w1  \n"
        "mov #0x46, w2     \n"
        "mov #0x57, w3     \n"
        "mov.b w2, [w1]    \n"
        "mov.b w3, [w1]    \n"
        "bclr OSCCON, #6");

    // INT1 >>> RP21
    RPINR0bits.INT1R = 21;

    /*------SPI1------*/
    // SCK1 >> RP26
    RPINR20bits.SCK1R = 26;
    RPOR13bits.RP26R  = 8;
    // SDO1 >> RP19
    RPOR9bits.RP19R   = 7;
    // SDI1 >> RP27
    RPINR20bits.SDI1R = 27;

    /*------SPI2------*/
    // SCK2 >> RP3
    RPINR22bits.SCK2R = 3;
    RPOR1bits.RP3R    = 11;
    //SDO2 >> RP2
    RPOR1bits.RP2R    = 10;
    // SDI2 >> RP4
    RPINR22bits.SDI2R = 4;

    /*------UART1-----*/
    // RX1 >> RP22
    RPINR18bits.U1RXR = 22;
    // TX1 >> RP25
    RPOR12bits.RP25R  = 3;

    /*------UART2-----*/
    // RX2 >> RP24
    RPINR19bits.U2RXR = 24;
    // TX2 >> RP23
    RPOR11bits.RP23R  = 5;

    //lock register
    asm volatile ("mov #OSCCONL, w1  \n"
        "mov #0x46, w2     \n"
        "mov #0x57, w3     \n"
        "mov.b w2, [w1]    \n"
        "mov.b w3, [w1]    \n"
        "bset OSCCON, #6");
    /*********************************end by lab411*****************************/
    CLRWDT();
    ENABLE_WDT();

    NetworkDescriptor = NULL;
    orphanTries = 3;
    #ifndef THEODOIDONGVAT
        /**************trongkhanhbkhn thoi gian gui*********/
       CYCLE_SENDING_5M = 1 * ONE_MINUTE_VALUE;// chu k? ki?m tra d? li?u là 5 phút
       CYCLE_SENDING = 100 * ONE_MINUTE_VALUE;//chu k? g?i d? li?u ??nh k? là 1 ngày 1 l?n
       TIME_SENDING_PACKET = 0;//1s gui 1 goi data
       COUNT_PACKET = 0;//dem so luong goi can gui
    #endif
   
    // If you are going to send data to a terminal, initialize module UART2.
    // Initialize module UART2 to communicate with Control Pump board.
    #if defined(USE_DEBUG) || defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
	ConsoleInit();
        UART1Init();
    #endif
        UART1Init();//xxxxx
    // Initialize module UART1 to communicate with Miniradar sensor.
    #if defined(USE_MINI_RADAR)
        UART1Init();
    #endif

