vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
    #if defined(USE_DEBUG)
        #if defined(USE_MINI_RADAR)
            printf("Init UART1\r\n");
        #endif
        printf("Init UART2\r\n");
    #endif

    // Initialize the hardware - must be done before initializing ZigBee.
    HardwareInit();
    
    #if defined(USE_DEBUG)
        printf("Init Hardware\r\n");
    #endif
    
    /* Initialize my status flags*/
    WSANFlags.Val = 0x0000;

    // Initialize the ZigBee Stack.
    ZigBeeInit();
    currentPrimitive = NO_PRIMITIVE;
    #if defined(USE_DEBUG)
        printf("Zigbee Init\r\n");
    #endif

    // *************************************************************************
    // Perform any other initialization here
    // *************************************************************************

    #if defined(USE_DEBUG)
        printf("-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_\r\n");
    /*****************DEFINE SENSOR NODE*****************/
        #if defined(SENSOR1)
            printf("ZigBee Router Sensor1");
        #elif defined(SENSOR2)
            printf("ZigBee Router Sensor2");
        #elif defined(SENSOR3)
            printf("ZigBee Router Sensor3");
        #elif defined(SENSOR4)
            printf("ZigBee Router Sensor4");
        #elif defined(SENSOR5)
            printf("ZigBee Router Sensor5");
        #elif defined(SENSOR6)
            printf("ZigBee Router Sensor6");
        #elif defined(SENSOR7)
            printf("ZigBee Router Sensor7");
        #elif defined(SENSOR8)
            printf("ZigBee Router Sensor8");
        #elif defined(SENSOR9)
            printf("ZigBee Router Sensor9");
        #elif defined(SENSOR10)
            printf("ZigBee Router Sensor10");

        /*****************DEFINE ACTOR NODE*****************/
        #elif defined(I_AM_ACTOR1)
            printf("ZigBee Router Actor1");
        #elif defined(I_AM_ACTOR2)
            printf("ZigBee Router Actor2");

        #else
            #error "Router not supported."
        #endif

        printf(" - R&D by WSAN-Lab411\r\n");
        #if (RF_CHIP == MRF24J40)
            printf("Transceiver-MRF24J40\r\n");
        #else
            printf("Transceiver-Unknown\r\n");
        #endif
    #endif

    // Enable interrupts to get everything going.
    RFIE = SET;

    /* Start the network anew each time Node is booted up */
    NWKClearNeighborTable();
    #if defined(I_SUPPORT_BINDINGS)
        ClearBindingTable();
    #endif

    /* Clear the Group Table */
    RemoveAllGroups();

    #if defined(I_SUPPORT_BINDINGS)
        RemoveAllBindings(macPIB.macShortAddress);
    #endif
    /*cai dat ban dau cho cmr*/
    #if defined(USE_PTC06)
        ConsoleInit();
        Initphoto();
        //Take_photo();
    #endif
    /* Clearing nwk status flags */
    nwkStatus.flags.Val = 0x00;
  
    while (1)
    {
        /* Clear the watch dog timer */
        CLRWDT();//xoa WDT

        /* Determine which is the next ZigBee Primitive to operate on */
        ZigBeeTasks( &currentPrimitive );//quyet dinh zb hoat dong tiep

        /* Process the next ZigBee Primitive */
        ProcessZigBeePrimitives();
        
        /* do any non ZigBee related tasks and then go back to ZigBee tasks */
        ProcessNONZigBeeTasks();

        /* use led to identify if device joined */
        #ifdef USE_PIR
        if(WSANFlags.bits.EnableReceivePIR == 0)
        {
            if(Led_Count == 0)
            {
                if(ZigBeeStatus.flags.bits.bNetworkJoined == 0)
                {
                    WSAN_LED = ~WSAN_LED;
                    Led_Count = BLINK_LED_NOT_JOIN;
                }
                else
                {
                    WSANFlags.bits.EnableReceivePIR = 1;
                    WSAN_LED = CLEAR;
                }
            }
            else
            {
                --Led_Count;
            }
        }

        #else
        if(Led_Count == 0)
        {
            WSAN_LED = ~WSAN_LED;

            if(ZigBeeStatus.flags.bits.bNetworkJoined)
            {
                Led_Count = BLINK_LED_JOIN;
            }
            else
                Led_Count = BLINK_LED_NOT_JOIN;
        }
        else
        {
            --Led_Count;
        }
        #endif
    }
}

void ProcessZigBeePrimitives(void)
{


    switch (currentPrimitive)
    {


        case NLME_ROUTE_DISCOVERY_confirm:
            #if defined(USE_DEBUG)
                if (!params.NLME_ROUTE_DISCOVERY_confirm.Status)
                {
                    printf("Route Reply OK\r\n" );
                }
                else
                {
                    PrintChar( params.NLME_ROUTE_DISCOVERY_confirm.Status );
                    printf(" Route Reply Failed\r\n" );
                }
            #endif
            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_NETWORK_DISCOVERY_confirm:
            currentPrimitive = NO_PRIMITIVE;

            switch(params.NLME_NETWORK_DISCOVERY_confirm.Status)
            {
                case 0x00:
                    #if defined(USE_DEBUG)
                        printf("Number of Zigbee network have been find: ");
                        PrintChar(params.NLME_NETWORK_DISCOVERY_confirm.NetworkCount);
                        printf("\r\n");
                    #endif
                    // Save the descriptor list pointer so we can destroy it later.
                    NetworkDescriptor = params.NLME_NETWORK_DISCOVERY_confirm.NetworkDescriptor;

                    // Select a network to try to join.  We're not going to be picky right now...
                    currentNetworkDescriptor = NetworkDescriptor;

SubmitJoinRequest:
                    params.NLME_JOIN_request.PANId = currentNetworkDescriptor->PanID;

                    #if defined(USE_DEBUG)
                        printf("Prepare join to network: 0x");
                        PrintWord(params.NLME_JOIN_request.PANId.Val);
                        printf("\r\n");
                    #endif

                    if(params.NLME_JOIN_request.PANId.Val != DesireNetworkID)
                    {
                        currentNetworkDescriptor = currentNetworkDescriptor->next;
                        if(currentNetworkDescriptor)
                        {
                            goto SubmitJoinRequest;
                        }
                        else
                        {
                            #ifdef USE_DEBUG
                                #if defined(THEODOIDONGVAT)
                                printf("Not found desire network 0x1AAB\r\n");
                                #endif

