vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
                                #if defined(CHAMSOCLAN) || defined(CANHBAOCHAYRUNG)
                                 printf("Not found desire network 0x1AAA\r\n");
                                #endif
                            #endif

                            ZigBeeStatus.flags.bits.bNetworkJoined = 0;
                            ZigBeeStatus.flags.bits.bTryingToJoinNetwork = 0;
                        }
                    }
                    else
                    {
                        #ifdef USE_DEBUG
                            #if defined(THEODOIDONGVAT)
                            printf("Found desire network 0x1AAB\r\n");
                            #endif

                            #if defined(CHAMSOCLAN) || defined(CANHBAOCHAYRUNG)
                            printf("Found desire network 0x1AAA\r\n");
                            #endif
                        #endif
                        params.NLME_JOIN_request.JoinAsRouter   = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork  = FALSE;
                        params.NLME_JOIN_request.PowerSource    = NOT_MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle   = TRUE;
                        params.NLME_JOIN_request.MACSecurity    = FALSE;
                        params.NLME_JOIN_request.ExtendedPANID = currentNetworkDescriptor->ExtendedPANID;

                        currentPrimitive = NLME_JOIN_request;

                        #if defined(USE_DEBUG)
                            printf("Network(s) found. Trying to join " );
                            PrintWord(params.NLME_JOIN_request.PANId.Val);
                            printf(" | ");
                            for(i=7;i ^ 0xFF;--i)
                                PrintChar(currentNetworkDescriptor->ExtendedPANID.v[i]);
                            printf("\r\n");
                        #endif
                    }
                    break;

                case 0xEA:
                    #if defined(USE_DEBUG)
                        if (!params.NLME_NETWORK_DISCOVERY_confirm.NetworkCount)
                        {
                            printf("No networks found. Trying again!\r\n" );
                        }
                    #endif
                    break;

                default:
                    #if defined(USE_DEBUG)
                        PrintChar( params.NLME_NETWORK_DISCOVERY_confirm.Status );
                        printf(" Error finding network. Trying again...\r\n" );
                    #endif
                    break;
            }
            break;

        case NLME_JOIN_confirm:
            if (!params.NLME_JOIN_confirm.Status)
            {
                #if defined(USE_DEBUG)
                    printf("Join OK!\r\n" );
                #endif

                // Free the network descriptor list, if it exists. If we joined as an orphan, it will be NULL.
                while (NetworkDescriptor)
                {
                    currentNetworkDescriptor = NetworkDescriptor->next;
                    nfree( NetworkDescriptor );
                    NetworkDescriptor = currentNetworkDescriptor;
                }

                // Start routing capability.
                params.NLME_START_ROUTER_request.BeaconOrder = MAC_PIB_macBeaconOrder;
                params.NLME_START_ROUTER_request.SuperframeOrder = MAC_PIB_macSuperframeOrder;
                params.NLME_START_ROUTER_request.BatteryLifeExtension = FALSE;
                currentPrimitive = NLME_START_ROUTER_request;
            }
            else
            {
                currentPrimitive = NO_PRIMITIVE;
                #if defined(USE_DEBUG)
                    printf("Status: ");
                    PrintChar( params.NLME_JOIN_confirm.Status );
                #endif

                // If we were trying as an orphan, see if we have some more orphan attempts.
                if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                {
                    // If we tried to join as an orphan, we do not have NetworkDescriptor, so we do
                    // not have to free it.
                    #if defined(USE_DEBUG)
                        printf(". Could not join as orphan. " );
                    #endif
                    orphanTries--;
                    if (orphanTries)
                    {
                        #if defined(USE_DEBUG)
                            printf("Trying again!\r\n" );
                        #endif
                        
                    }
                    else
                    {
                        orphanTries = 3;
                        #if defined(USE_DEBUG)
                            printf("Must try as new node!\r\n" );
                        #endif
                        ZigBeeStatus.flags.bits.bTryOrphanJoin = CLEAR;
                    }
                }
                else
                {
                    #if defined(USE_DEBUG)
                        printf(". Could not join selected network: " );
                        PrintWord(currentNetworkDescriptor->PanID.Val);
                    #endif
                    currentNetworkDescriptor = currentNetworkDescriptor->next;
                    if (currentNetworkDescriptor)
                    {
                        #if defined(USE_DEBUG)
                            printf(". Trying next discovered network: " );
                            PrintWord(currentNetworkDescriptor->PanID.Val);
                            printf("\r\n");
                        #endif
                        goto SubmitJoinRequest;
                    }
                    else
                    {
                        //Ran out of descriptors.  Free the network descriptor list, and fall
                        // through to try discovery again.
                        #if defined(USE_DEBUG)
                            printf(". Cleaning up and retrying discovery!\r\n" );
                        #endif
                        while (NetworkDescriptor)
                        {
                            currentNetworkDescriptor = NetworkDescriptor->next;
                            nfree( NetworkDescriptor );
                            NetworkDescriptor = currentNetworkDescriptor;
                        }
                    }
                }
            }
            break;

        case NLME_START_ROUTER_confirm:
            if (!params.NLME_START_ROUTER_confirm.Status)
            {
                #if defined(USE_DEBUG)
                    printf("Router Started! Enabling joins...\r\n" );
                #endif
                params.NLME_PERMIT_JOINING_request.PermitDuration = 0xFF;   // No Timeout
                params.NLME_PERMIT_JOINING_request._updatePayload = TRUE;
                currentPrimitive = NLME_PERMIT_JOINING_request;
            }
            else
            {
                #if defined(USE_DEBUG)
                    PrintChar( params.NLME_JOIN_confirm.Status );
                    printf(" Router start Failed. We cannot route frames\r\n" );
                #endif
                currentPrimitive = NLME_START_ROUTER_request;//request again
            }
            break;

        case NLME_PERMIT_JOINING_confirm:
            currentPrimitive = NO_PRIMITIVE;
            if (!params.NLME_PERMIT_JOINING_confirm.Status)
            {
                #if defined(USE_DEBUG)
                    printf("Joining permitted!\r\n");
                    printf("Current Network Address is: ");
                    PrintWord(macPIB.macShortAddress.Val);
                    printf("\r\n");
                #endif

                // gui toi bo nhung cho biet no vua gia nhap mang
                SendOneByte(MAC_LONG_ADDR_BYTE0, JOIN_CONFIRM_CLUSTER);

                #if defined (USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
                    AD1CON1bits.SAMP = SET;//Neu dung MQ6 thi khong do ngay
                #endif
            }
            else
            {
                #if defined(USE_DEBUG)
                    PrintChar( params.NLME_PERMIT_JOINING_confirm.Status );
                    printf(" Join permission Failed. We cannot allow joins\r\n" );
                #endif
            }
            break;

        case NLME_JOIN_indication:
            #if defined(USE_DEBUG)
                printf( "Node " );
                PrintWord(params.NLME_JOIN_indication.ShortAddress.Val);
                printf( " With MAC Address " );
                //@dat_a3cbq91: Print MAC address of node has just joined
                for(i = 7; i ^ 0xFF; --i)
                {
                    PrintChar(params.NLME_JOIN_indication.ExtendedAddress.v[i]);
                }
                printf( " just joined.\r\n" );
            #endif

            /* For Zigbee 2006: If a new device with the same old longAddress address
             * joins the PAN, then make sure the old short address is no longer used and is
             * overwritten with the new shortAddress & longAddress combination
             */
            {  /* same long address check block */
                APS_ADDRESS_MAP currentAPSAddress1;
                currentAPSAddress1.shortAddr   =   params.NLME_JOIN_indication.ShortAddress;
                currentAPSAddress1.longAddr    =   params.NLME_JOIN_indication.ExtendedAddress;

                if(LookupAPSAddress(&params.NLME_JOIN_indication.ExtendedAddress) )
                {
                    for( i = 0; i ^ apscMaxAddrMapEntries; i++)
                    {
                        #ifdef USE_EXTERNAL_NVM
                            GetAPSAddress( &currentAPSAddress,  apsAddressMap + i * sizeof(APS_ADDRESS_MAP) );
                        #else
                            GetAPSAddress( &currentAPSAddress,  &apsAddressMap[i] );
                        #endif
                            if (!memcmp( (void *)&currentAPSAddress.longAddr, (void *)&currentAPSAddress1.longAddr, 8 ))
                            {
                                /* overwrite the old with the new short/long address combo  */
                                #ifdef USE_EXTERNAL_NVM
                                    PutAPSAddress( apsAddressMap + i * sizeof(APS_ADDRESS_MAP), &currentAPSAddress1);
                                #else
                                    PutAPSAddress( &apsAddressMap[i], &currentAPSAddress1 );
                                #endif
                            }
                    }   /* end for loop */
                }   /* end if */
            }   /* end address check block */
        
            #ifdef I_SUPPORT_SECURITY
                #ifdef I_AM_TRUST_CENTER
                {
                    BOOL AllowJoin = TRUE;
                    // decide if you allow this device to join
                    if( !AllowJoin )
                    {
                        // no need to set deviceAddress, since it is overlap with NLME_JOIN_indication
                        //params.NLME_LEAVE_request.DeviceAddress = params.NLME_JOIN_indication.ExtendedAddress;
                        params.NLME_LEAVE_request.RemoveChildren = TRUE;
                        currentPrimitive = NLME_LEAVE_request;
                        break;
                    }

                    #ifdef I_SUPPORT_SECURITY_SPEC
                        if( params.NLME_JOIN_indication.secureJoin )
                        {
                            BYTE i;
                            for(i = 0; i < 16; i++)
                            {
                                    KeyVal.v[i] = 0;
                            }
                            params.APSME_TRANSPORT_KEY_request.Key = &KeyVal;
                            params.APSME_TRANSPORT_KEY_request.TransportKeyData.NetworkKey.KeySeqNumber = 0;

