vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
        case NLME_RESET_confirm:
            #if defined(USE_DEBUG)
                printf("ZigBee Stack has been reset\r\n" );
            #endif
            /* For Zigbee 2006 The Specs require that node needs to
             * try joining as an orphan first after each reset,
             * see Mandatory test 3.9
             */
            ZigBeeStatus.flags.bits.bTryOrphanJoin = SET;

            currentPrimitive = NO_PRIMITIVE;
            break;

        case NLME_LEAVE_confirm:
            #if defined(USE_DEBUG)
                PrintChar(params.NLME_LEAVE_confirm.Status);
                printf(" Leaving the Zigbee network\r\n" );
            #endif

            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSDE_DATA_indication:
            {
                #ifndef THEODOIDONGVAT
                    BYTE data;
                #endif

                currentPrimitive = NO_PRIMITIVE;
                #if defined (USE_DEBUG)
                     printf("params.APSDE_DATA_indication.ClusterId.Val..:");
                     UART1PrintChar(params.APSDE_DATA_indication.ClusterId.Val);
                     printf("\r\n");
                #endif

                switch (params.APSDE_DATA_indication.DstEndpoint)
                {
                    case WSAN_Endpoint:
                    {
                        #if defined (USE_DEBUG)
                             printf("params.APSDE_DATA_indication.ClusterId.Val..:");
                             UART1PrintChar(params.APSDE_DATA_indication.ClusterId.Val);
                             printf("\r\n");
                        #endif

                        switch (params.APSDE_DATA_indication.ClusterId.Val)
                        {
                            //VAN_CHINH_K57 - retasking
                            case STATUS_REQUEST:
                            {
                                Send_STATUS(STATUS_RESPONSE);
                            }
                            break;
                            case RETASK_SHT10:
                            {
                                data = APLGet();
//                                UART1PrintChar(data);
                                #if defined(USE_SHT10)
                                    if(data == 0x50)
                                        SHT_STATUS = 0;
                                    if(data == 0x51)
                                        SHT_STATUS = 1;
                                    Send_STATUS(STATUS_RESPONSE);
                                #else
                                    Send_STATUS(NONE_SUPPORT);
                                #endif
                            }
                            break;
                            case RETASK_BROADCAST_SHT10:
                            {
                                data = APLGet();
//                                UART1PrintChar(data);
                                #if defined(USE_SHT10)
                                    if(data == 0x52)
                                        SHT_STATUS = 0;
                                    if(data == 0x53)
                                        SHT_STATUS = 1;
                                #endif
                            }
                            break;
                            case RETASK_PTC06:
                            {
                                data = APLGet();
                                //UART1PrintChar(data);
                                #if defined(USE_PTC06)
                                    if(data == 0x60)
                                        PTC06_STATUS = 0;
                                    if(data == 0x61)
                                        PTC06_STATUS = 1;
                                    Send_STATUS(STATUS_RESPONSE);
                                #else
                                    Send_STATUS(NONE_SUPPORT);
                                #endif
                            }
                            break;
                            case RETASK_BROADCAST_PTC06:
                            {
                                data = APLGet();
                                //UART1PrintChar(data);
                                #if defined(USE_PTC06)
                                    if(data == 0x62)
                                        PTC06_STATUS = 0;
                                    if(data == 0x63)
                                        PTC06_STATUS = 1;
                                #endif
                            }
                            break;
                            case RETASK_CYCLE_SENDING:
                            {
                                data = APLGet();
                                //UART1PrintChar(data);
                                #ifndef THEODOIDONVAT
                                    if(data == 0x70)
                                        CYCLE_SENDING_STATUS = 0;
                                    if(data == 0x71)
                                        CYCLE_SENDING_STATUS = 1;
                                    Send_STATUS(STATUS_RESPONSE);
                                #else
                                    Send_STATUS(NONE_SUPPORT);
                                #endif
                            }
                            break;
                            case RETASK_BROADCAST_CYCLE_SENDING:
                            {
                                data = APLGet();
//                                UART1PrintChar(data);
                                #ifndef THEODOIDONVAT
                                    if(data == 0x72)
                                        CYCLE_SENDING_STATUS = 0;
                                    if(data == 0x73)
                                        CYCLE_SENDING_STATUS = 1;
                                #endif
                            }
                            break;
                            case RETASK_ALL_FUNCTION:
                            {
                                BYTE f1, f2, f3;
                                f1 = APLGet();
                                f2 = APLGet();
                                f3 = APLGet();
//                                UART1PrintChar(f1);
//                                UART1PrintChar(f2);
//                                UART1PrintChar(f3);
                                #if defined(USE_SHT10)
                                    SHT_STATUS = f1;
                                #endif
                                #if defined(USE_PTC06)
                                    PTC06_STATUS = f2;
                                #endif
                                #ifndef THEODOIDONVAT
                                    CYCLE_SENDING_STATUS = f3;
                                #endif
                                Send_STATUS(STATUS_RESPONSE);
                            }
                            break;
                            case RETASK_BROADCAST_ALL_FUNCTION:
                            {
                                BYTE f1, f2, f3;
                                f1 = APLGet();
                                f2 = APLGet();
                                f3 = APLGet();
//                                UART1PrintChar(f1);
//                                UART1PrintChar(f2);
//                                UART1PrintChar(f3);
                                #if defined(USE_SHT10)
                                    SHT_STATUS = f1;
                                #endif
                                #if defined(USE_PTC06)
                                    PTC06_STATUS = f2;
                                #endif
                                #ifndef THEODOIDONVAT
                                    CYCLE_SENDING_STATUS = f3;
                                #endif
                            }
                            
                            //user clusterID application
                            #ifdef USE_SAVE_ENERGY_MODE
                                //case SAVE_ENERGY_SYN_CLUSTER://#define SAVE_ENERGY_SYN_CLUSTER   0x000B
                                case SLEEP_SYN_CLUSTER:
                                {
                                    APLGet();
                                    SendOneByte(MAC_LONG_ADDR_BYTE0, SLEEP_CONFIRM_CLUSTER);
                                    WSANFlags.bits.DeviceMode = SaveEnergyMode;
                                    TimerCount = 0;
                                    #ifdef USE_DEBUG
                                        printf("Change to mode SaveEnergy\r\n");
                                    #endif
                                }
                                break;

                                case WAKE_SYN_CLUSTER:
                                {
                                    SendOneByte(MAC_LONG_ADDR_BYTE0, WAKE_CONFIRM_CLUSTER);
                                    WSANFlags.bits.DeviceMode = ActiveMode;
//                                    WSANFlags.bits.Autocmr == CLEAR;
                                    TimerCount = 0;
                                    #ifdef USE_DEBUG
                                        printf("Change to mode Active\r\n");
                                    #endif
                                }
                                break;
                            #endif

