vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
                            #if defined (TRACE_ROUTE_SUPPORT)
                                case ROUTE_DRAW_REQUEST_CLUSTER:
                                {
                                    BYTE i;
                                    BYTE MSB_dest_addr;
                                    BYTE LSB_dest_addr;
                                    BYTE NodeNumber;
                                    BYTE *pListOfNode;
                                    MSB_dest_addr = APLGet();//Lay ra dia chi dich can tim tuyen
                                    LSB_dest_addr = APLGet();
                                    NodeNumber    = APLGet();//So Node can di qua
                                    for (i = 0; i< NodeNumber; i++) pListOfNode[i] = APLGet();//Lay ra byte 0 dia chi MAC tat ca cac node di qua
                                    if ((macPIB.macShortAddress.v[1] == MSB_dest_addr)&&(macPIB.macShortAddress.v[0] == LSB_dest_addr)) RouteDrawReply(NodeNumber, pListOfNode);//Neu la node dich thi gui ket qua ve ROUTER_EMB
                                    else RouteDrawRequestToNextHop(MSB_dest_addr, LSB_dest_addr, NodeNumber, pListOfNode);//tiep tuc gui tin yeu cau ve tuyen den node tiep theo
                                }
                                break;
                            #endif

                            #if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
                                case ACTOR_REQUEST_CLUSTER:
                                {
                                    //cau truc ban tin yeu cau bat bom tu router-emboard
                                    //------------------------------------------------------------------------------------
                                    // 0bSVVVVVVV
                                    // S = 0 --> tat, S = 1 --> bat
                                    // VVVVVVV --> van nao duoc bat/tat, dac biet, neu VVVVVVV = 0b1111111 thi tat ca ca van duoc bat/tat
                                    //------------------------------------------------------------------------------------
                                    data = APLGet();// lay lenh bat/tat bom tuoi
                                    ConsolePut(data);//lenh nay dung that khi bat dieu khien may bom.
                                }
                                break;
                            #endif
                           

                            #if defined(USE_SHT10)
                                case HTE_REQUEST_CLUSTER://gui du lieu nhiet do do am ma emboard yeu cau
                                {
                                   if(SHT_STATUS == 1 ){
                                       APLGet();
                                       LoadSHT10();//lay du lieu nhiet do - do am
                                       Send_HTE_ToRouterEmboard(HTE_RESPONSE_CLUSTER);
                                   }
                                   else
                                   {
                                       //SendOneByte(MAC_LONG_ADDR_BYTE0, NONE_SUPPORT);
                                       Send_STATUS(STATUS_RESPONSE);
                                   }
                                }
                                break;
                                
                                case RE_CONFIG_CYCLE_CLUSTER:
                                {
                                    data = APLGet();
                                    CYCLE_SENDING = data * 60;//data = 1 -> 5phut, data = 2 -> 10 phut,...
                                    TimerCount = 0;
                                    #ifdef USE_DEBUG
                                        printf("CYCLE_LEVEL = ");
                                        PrintChar(CYCLE_SENDING);
                                        printf("\r\n");
                                    #endif

                                }
                                break;
                                
                            #endif
                            /****************lenh chup anh ************************/
                                            /*quanghoa*/
                            #if defined(USE_PTC06)
                                
                            case CMR_REQUEST_CLUSTER:
                            {
                                APLGet();
                                if(PTC06_STATUS == 1){
                                    Take_photo();
                                    WSANFlags.bits.Autocmr = SET;
                                    TimerCount = 0;
                                }
                                else {
                                   //SendOneByte(MAC_LONG_ADDR_BYTE0, NONE_SUPPORT);
                                   Send_STATUS(STATUS_RESPONSE);
                                }
                            }break;

                            case PACKET_REQUEST_CLUSTER:
                            {
                                data = APLGet();
                                Send_Packet_ToRouterEmboard(PACKET_RESPONSE_CLUSTER, data);
                            }break;
                                
                            #endif

                            #if defined(USE_MQ6_V1)
                                case RE_ASSIGN_LEVEL_MQ6_CLUSTER:
                                {
                                    data = APLGet();
                                    ThresholdMQ6 = Threshold_0 + data * STEP_OF_THRES;
                                    #ifdef USE_DEBUG
                                        printf("MQ6_LEVEL = ");
                                        PrintWord(ThresholdMQ6);
                                        printf("\r\n");
                                    #endif
                                }
                                break;

                            #endif

                            case 0x0005:
                            case 0x0006:
                                #ifdef USE_DEBUG
                                    printf("Sending loop back\r\n");
                                #endif
                                break;

                            default:
                                /* Catch all place for all none ZDO msgs not processed above */
                                #if defined(USE_DEBUG)
                                    PrintWord(params.APSDE_DATA_indication.ClusterId.Val);
                                    PrintChar(APLGet());
                                    printf(" Non-support ClusterID...\r\n");
                                #endif
                                break;
                        }
                        if (currentPrimitive != APSDE_DATA_request)
                        TxData = TX_DATA_START;//reset lai chi so TxData
                    }
                        break;

                    default:
                        break;
                }
                APLDiscardRx();
            }
            break;

        case APSDE_DATA_confirm:
            if (params.APSDE_DATA_confirm.Status)
            {
                #if defined(USE_DEBUG)
                    PrintChar(params.APSDE_DATA_confirm.Status);
                    printf(" Error sending message\r\n");
                #endif
            }
            else
            {
                #if defined(USE_DEBUG)
                    printf("Sending message OK!\r\n" );
                #endif

                #if defined(USE_SAVE_ENERGY_MODE)
                    //Gui xac nhan ve RE da hoat dong o che do save energy thanh cong thi lam viec nay!
                    if (WSANFlags.bits.DeviceMode)
                    {
                        SleepingState = SET;//vao trang thai ngu
                        WakingState = CLEAR;
                    }
                #endif
            }
                
