vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
            currentPrimitive = NO_PRIMITIVE;
            break;

        case APSME_ADD_GROUP_confirm:
        case APSME_REMOVE_GROUP_confirm:
        case APSME_REMOVE_ALL_GROUPS_confirm:
            #if defined(USE_DEBUG)
                printf("Perform Group Operation\r\n" );
            #endif
            currentPrimitive = NO_PRIMITIVE;
            break;

        /* if nothing to process first check to see if we are in startup seqence */
        case NO_PRIMITIVE:
            if (AllowJoin && (!ZigBeeStatus.flags.bits.bNetworkJoined))
            {
                if (!ZigBeeStatus.flags.bits.bTryingToJoinNetwork)
                {
                    if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                    {
                        #if defined(USE_DEBUG)
                            printf("Trying to join network as an orphan...\r\n" );
                        #endif

                        params.NLME_JOIN_request.ScanDuration     = 8;
                        params.NLME_JOIN_request.ScanChannels.Val = ALLOWED_CHANNELS;
                        params.NLME_JOIN_request.JoinAsRouter     = TRUE;
                        params.NLME_JOIN_request.RejoinNetwork    = 0x01;//rejoining the network using the orphaning procedure
                        params.NLME_JOIN_request.PowerSource      = NOT_MAINS_POWERED;
                        params.NLME_JOIN_request.RxOnWhenIdle     = TRUE;
                        params.NLME_JOIN_request.MACSecurity      = FALSE;

                        params.NLME_JOIN_request.ExtendedPANID    = currentNetworkDescriptor->ExtendedPANID;
                        currentPrimitive = NLME_JOIN_request;
                    }
                    else
                    {
                        #if defined(USE_DEBUG)
                            printf("Trying to join network as a new device...\r\n" );
                        #endif
                        params.NLME_NETWORK_DISCOVERY_request.ScanDuration          = 8;
                        params.NLME_NETWORK_DISCOVERY_request.ScanChannels.Val      = ALLOWED_CHANNELS;
                        currentPrimitive = NLME_NETWORK_DISCOVERY_request;
                    }
                }
            }
            else
            {
                if(!ZigBeeStatus.flags.bits.bHasBackgroundTasks)
                {
                    // ************************************************************************
                    // Place all processes that can send messages here.  Be sure to call
                    // ZigBeeBlockTx() when currentPrimitive is set to APSDE_DATA_request.
                    // ************************************************************************
                    #if defined(USE_MQ6_V2)
                        //gui thong tin co khoi ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.MQ6Warning)
                        {
                            WSANFlags.bits.MQ6Warning = CLEAR;
                            SendOneByte(DetectingSmoke,STATE_NODE_CLUSTER);//thong bao co khoi ve router-emboard
                            //#if defined(USE_DEBUG)
                                printf("Sending warning fire-forest to RE\r\n");
                            //#endif
                        }
                    #endif
		
                    #if defined(USE_WARNING_LOW_POWER)
                        //gui thong tin sap het nang luong ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.LowPowerWarning)
                        {
                            WSANFlags.bits.LowPowerWarning = CLEAR;
                            
                            if(NumberOfWarning == 0)
                            {
                                SUPPLY_VOLT_ZENER = CLEAR;//tat nguon cap cho diode zener
                                AD1CON1bits.ADON = CLEAR;//tat module ADC
                                #if defined(USE_LED)
                                    WSAN_LED_TRIS = 1;
                                #endif
                            }
                            else
                            {
                                --NumberOfWarning;
                                SendOneByte(LowPower,STATE_NODE_CLUSTER);
                                #if defined(USE_DEBUG)
                                    printf("Sending warning low-power to RE\r\n");
                                #endif
                            }
                        }
                    #endif

                    #if defined(USE_SHT10)
                        //gui thong tin nhiet do-do am dinh ky ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.HTE_Data_Ready)
                        {
                            WSANFlags.bits.HTE_Data_Ready = CLEAR;
                            Send_HTE_ToRouterEmboard(HTE_AUTO_SEND_CLUSTER);
                            #if defined(USE_DEBUG)
                                printf("Sending period data to RE \r\n");
                            #endif
                        }
                    #endif
                    // **************quanghoa********************
                    #if defined(USE_PTC06)
                        //gui tung goi da 80byte ve router-emboard
                        if(ZigBeeReady() && WSANFlags.bits.CMR_Data_Ready)
                        {
                            WSANFlags.bits.CMR_Data_Ready = CLEAR;
//                            Send_MAC_ToRouterEmboard(CMR_RESPONSE_CLUSTER);//gui dia chi mac va do dai
                            Send_IMAGE_ToRouterEmboard(CMR_RESPONSE_CLUSTER);//gui dia chi mac va do dai anh + goi data do dai 80byte
                            #if defined(USE_DEBUG)
                                printf("Sending period data to RE \r\n");
                            #endif
                            if(COUNT_PACKET==((int)length_data/80+1))   //xet bien dem goi = so luong goi thi dung gui
                         {
                            COUNT_PACKET = 0;
                            //length_data=0;
                            WSANFlags.bits.Autocmr = CLEAR;
                         }
                        }
                    #endif

                    #if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
                        if(ZigBeeReady() && WSANFlags.bits.ActorAckReceive)
                        {
                            WSANFlags.bits.ActorAckReceive = CLEAR;
                            SendOneByte(StatusActor,ACTOR_RESPONSE_CLUSTER);//bao ve Gateway da ra lenh dieu khien bat/tat van tuoi
                            
