vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
            #if defined(USE_DEBUG)
                printf("Temperature (hex): ");
                PrintWord(temperature);
                printf("\r\n");

                printf("Humidity (hex): ");
                PrintWord(humidity);
                printf("\r\n");
            #endif
           
            WSANFlags.bits.HTE_Data_Ready = SET;//cho phep gui du lieu dinh ki ve gateway
           
        }

  //  #else
        /*************trongkhanh****************/
        if(WSANFlags.bits.EnableGetDataHTE5M)
        {
            WSANFlags.bits.EnableGetDataHTE5M = CLEAR;
            LoadSHT10();

            #if defined(USE_DEBUG)
                printf("Temperature (hex): ");
                PrintWord(temperature);
                printf("\r\n");

                printf("Humidity (hex): ");
                PrintWord(humidity);
                printf("\r\n");
            #endif

           Send_HTE_ToRouterEmboard(HTE_AUTO_SEND_CLUSTER);
           #if defined(USE_DEBUG)
           printf("Just sent data positio for request of Router_EMB\r\n");
          #endif

  }
           #endif
        /************quang hoa**************/
        #if defined(USE_PTC06)
        //Lay du lieu anh
        if(WSANFlags.bits.EnableGetDataCMR)
        {
            WSANFlags.bits.EnableGetDataCMR = CLEAR;
          /*  Take_photo();

            #if defined(USE_DEBUG)
                printf("data (hex): ");
                WORD i;
                for(i=0;i<length_data;i++){
                    PrintChar(data[i]);
                }
                printf("\r\n");

                printf("length_data (hex): ");
                PrintWord(length_data);
                printf("\r\n");
            #endif*/

            WSANFlags.bits.CMR_Data_Ready = SET;//cho phep gui du lieu dinh ki ve gateway
          }
        #endif
      

        #if defined(USE_SAVE_ENERGY_MODE)
	if (SendDataAfterSleep)
        {
            WSANFlags.bits.EnableGetDataHTE = SET;
            SendDataAfterSleep = CLEAR;
        }
        #endif
 

    #if defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)
    if (WSANFlags.bits.MQ6orVoltage == Finish_Convert)
    {
//        #if defined(USE_DEBUG)
//            /* Hien thi ket qua tu cam bien khoi */
//            printf("MQ6 signal (hex): ");
//            UART1PrintWord(Mq6Signal);
//            printf("\r\n");
//
//            /* Hien thi ket qua do dien ap nguon */
//            printf("Voltage (hex): ");
//            UART1PrintWord(Energy_Level);
//            printf("\r\n");
//        #endif

//        if(WSANFlags.bits.DisableGetThresMq6 == 0)
//        {
//            if(WSANFlags.bits.OnTimeGetMQ6 == 1)
//            {
//                Threshold_0 = Mq6Signal + 150;//lay nguong canh bao chay co ban.
//                ThresholdMQ6 = Threshold_0;//gia tri nguong nay thay doi duoc dua tren gia tri nguong co ban.
//                #if defined(USE_DEBUG)
//                    printf("Theshold MQ6 signal (hex): ");
//                    UART1PrintWord(ThresholdMQ6);
//                    printf("\r\n");
//                #endif
//                WSANFlags.bits.DisableGetThresMq6 = 1;
//            }
//        }
//        else
//        {
//            if (Mq6Signal > ThresholdMQ6)
//            {
//                #if defined(USE_DEBUG)
//                    printf("Detecting smoke\r\n");
//                #endif
//                WSANFlags.bits.MQ6Warning = SET;//kich hoat viec gui tin hieu ve router emboard
//            }
//        }

        if (Energy_Level > ThresholdPower)
        {
//            #if defined(USE_DEBUG)
//                printf("Detecting low power\r\n");
//            #endif
            WSANFlags.bits.LowPowerWarning = SET;//kich hoat viec gui tin hieu ve router emboard
        }

        Mq6Signal = 0;//Clear this variable to reuse
        WSANFlags.bits.MQ6orVoltage = Power_Mode_ADC;//start with new cycle
    }
    #endif

    #if defined(USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
    if(WSANFlags.bits.CompleteADC)
    {
        #if defined(USE_DEBUG)
            printf("Voltage (hex): ");
            UART1PrintWord(Energy_Level);
            printf("\r\n");
        #endif
        if (Energy_Level > ThresholdPower)
        {
            #if defined(USE_DEBUG)
                printf("Detecting low power\r\n");
            #endif
            WSANFlags.bits.LowPowerWarning = SET;
        }
        WSANFlags.bits.CompleteADC = CLEAR;
    }
    #endif

    #if !defined(USE_WARNING_LOW_POWER) && defined(USE_MQ6_V1)

    if(WSANFlags.bits.CompleteADC)
    {
        #if defined(USE_DEBUG)
            printf("MQ6 signal (hex): ");
            UART1PrintWord(Mq6Signal);
            printf("\r\n");
        #endif

//        if(WSANFlags.bits.DisableGetThresMq6 == 0)
//        {
//            if(WSANFlags.bits.OnTimeGetMQ6 == 1)
//            {
//                Threshold_0 = Mq6Signal + 150;
//                ThresholdMQ6 = Threshold_0;
//                #if defined(USE_DEBUG)
//                    printf("Theshold MQ6 signal (hex): ");
//                    UART1PrintWord(ThresholdMQ6);
//                    printf("\r\n");
//                #endif
//                WSANFlags.bits.DisableGetThresMq6 = 1;
//            }
//        }
//        else
//        {
//            if (Mq6Signal > ThresholdMQ6)
//            {
//                #if defined(USE_DEBUG)
//                    printf("Detecting smoke\r\n");
//                #endif
//                WSANFlags.bits.MQ6Warning = SET;
//            }
//        }
        
        Mq6Signal = 0;//Clear this variable to reuse

        WSANFlags.bits.CompleteADC = CLEAR;
    }
    #endif

    #if defined(USE_PIR)
    if(WSANFlags.bits.EnableReceivePIR)
    {
        if(PORTFbits.RF6)
            WSAN_LED = CLEAR;
        else
            WSAN_LED = SET;
    }
    #endif

}

/*******************************************************************************
HardwareInit

All port directioning and SPI must be initialized before calling ZigBeeInit().

For demonstration purposes, required signals are configured individually.
*******************************************************************************/
void HardwareInit(void)
{
    /*Configure digital pins @ added by dat_a3cbq91*/
    ANSE = 0x0000;
    ANSG = 0x0000;
    ANSD = 0x0000;

