vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
    /*Configure for SPI communication*/
    #if(CLOCK_FREQ < 1000000)
        //SPI1 for RF transceiver
        SPI1CON1 = 0b0000000100111111;      // CLOCK_FREQ as SPI CLOCK
        SPI1STAT = 0x8000;

        //SPI2 for EEPROM
        SPI2CON1 = 0b0000000100111111;      // CLOCK_FREQ as SPI CLOCK
        SPI2STAT = 0x8000;
    #else
        //comment by dat_a3cbq91
        /* SPI1 for RF transceiver */
        SPI1CON1 = 0b0000000100111110;  //PIC24FJ128GA306 is Master, MRF24J40 is Slaver
                                        //Internal SPI clock is enabled
                                        //SDO1 pin is controlled by the module
                                        //Communication is byte-wide (8 bits)
                                        //Input data is sampled at the middle of data output time
                                        //Serial output data changes on transition from active clock state to Idle clock state
                                        //~SS1 pin is not used by the module; pin is controlled by the port function
                                        //Idle state for the clock is a low level; active state is a high level
                                        //Secondary prescale 1:1
                                        //Primary prescale 4:1 -> CLOCK_FREQ/2/4 as SPI CLOCK

        //Enables module and configures SCKx, SDOx, SDIx and ~SSx as serial port pins
        //Interrupt when the last data in the receive buffer is read; as a result, the buffer is empty (SRXMPT bit is set)
        SPI1STAT = 0x8000;

        /* SPI2 for EEPROM */
        //same as configuration SPI1 module
        SPI2CON1 = 0b0000000100111110;
        SPI2STAT = 0x8000;
    #endif

    #ifdef USE_EXTERNAL_NVM
    	EEPROM_nCS	= 1;
    	EEPROM_nCS_TRIS	= 0;
    	IFS2bits.SPI2IF = 1;
    #endif

    PHY_RESETn = 0;
    PHY_RESETn_TRIS = 0;
    PHY_CS = 1;
    PHY_CS_TRIS = 0;

    RFIF = 0;
    RFIE = 1;

    if(RF_INT_PIN == 0)
    {
        RFIF = 1;
    }

    /*Configure for other modules that designed by lab411*/
    // configure for led module
    #if defined(USE_LED)
        WSAN_LED_TRIS = 0;
        WSAN_LED = CLEAR;//Clear Led to a initialize state
    #endif
    
    // configure for ADC module
        //config for pin
    #if defined(USE_WARNING_LOW_POWER) || defined(USE_MQ6_V1)
        #if defined(USE_WARNING_LOW_POWER)
            //input analog at AN8
            VOLTAGE_MEASURE_ANALOG = SET;
            VOLTAGE_MEASURE_TRIS = 1;
            //SET supply voltage to Zener Diode
            SUPPLY_VOLT_ZENER_TRIS = 0;
            SUPPLY_VOLT_ZENER = SET;
        #endif
        
        #if defined(USE_MQ6_V1)
            MQ6_MEASURE_ANALOG = SET;
            MQ6_MEASURE_TRIS = 1;
        #endif

        //configure ADC module
        AD1CON1 = 0x0470;//12-bit A/D operation
                        //Output format bit is absolute decimal result, unsigned, right-justified
                        //Internal counter ends sampling and starts conversion
                        //Sampling begins when SAMP bit is manually set

        AD1CON2 = 0x0800;//VDD is voltage reference
                        //AD1CON2 = 0x4800;//external positive voltage reference --> for measure signal from smoke sensor
                        //Conversion result is loaded into the buffer POWER_SUPPLY_BUFF
                        //Interrupt at the completion of conversion for each sample
                        //Always uses channel input selects for Sample A

        AD1CON3 = 0x1F02;//Sample Time = 31Tad, Tad = 3Tcy

        #if defined(USE_WARNING_LOW_POWER)
            AD1CHS = VOLTAGE_MEASURE_CHANNEL;//do dien ap dau tien
        #else
            AD1CHS = MQ6_MEASURE_CHANNEL;//do MQ6
        #endif

        AD1CON1bits.ADON = SET;//bat dau lay gia tri dien ap
        
        //config for ADC interrupt
        IFS0bits.AD1IF = CLEAR;
        IEC0bits.AD1IE = SET;
        IPC3bits.AD1IP = 6;
    #endif

    // configure for I2C software module to connect with SHT sensor.
    #if defined(USE_SHT10)
        // Make RG2, RG3 outputs.
        SCK_TRIS    =   CLEAR;
        DATA_TRIS   =   CLEAR;
    #endif

    // check Miniradar if it connect with this board target
    #ifdef USE_MINI_RADAR
        if(CheckMiniRadar())
        {
            WSANFlags.bits.MicrowaveState = 1;
            #if defined(USE_DEBUG)
                printf("Miniradar V2.0 found device\r\n");
            #endif
        }
        else
        {
            WSANFlags.bits.MicrowaveState = 0;
            #if defined(USE_DEBUG)
                printf("Motion Sensor not found\r\n");
            #endif
        }
    #endif

    // configure interface to connect with PIR
    #if defined(USE_PIR) || defined(USE_MQ6_V2)

        INTCON1bits.NSTDIS = 1;//Interrupt nesting is disabled
        INTCON2bits.INT0EP = 1;//neg edge

        IPC0bits.INT0IP = 0b111;// Interrupt priority level 7

        IFS0bits.INT0IF = CLEAR;// Interrupt request has not occurred
        IEC0bits.INT0IE = SET;

        TRISFbits.TRISF6 = 1;//RF6 connect to signal wire of PIR or MQ6_V2
        PORTFbits.RF6 = CLEAR;
    #endif
}

/*******************************************************************************
User Interrupt Handler

The stack uses some interrupts for its internal processing. Once it is done
checking for its interrupts, the stack calls this function to allow for any
additional interrupt processing.
*******************************************************************************/

//this routine is written by dat_a3cbq91
void _ISR __attribute__((interrupt, auto_psv)) _T3Interrupt(void)
{
      
    IFS0bits.T3IF = CLEAR;
    #if defined(THEODOIDONGVAT)
        #if defined(USE_MINI_RADAR)
            if(WSANFlags.bits.EnableReceiveMW == CLEAR)
            {
                WSANFlags.bits.EnableReceiveMW = SET;
                printf("Cho phep nhan W\r\n");
            }
        #endif
    #else
    //if (SleepingStateTimerFlag) SleepTimer ++;

    TimerCount++;
    #if defined(USE_MQ6_V2)
        Timer_MQ6++;

        if(TimerCount == 30)
            WSANFlags.bits.OnTimeGetMQ6 = SET;

