vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
        if(Timer_MQ6 == CYCLE_MQ6 && WSANFlags.bits.OnTimeGetMQ6 == CLEAR)
        {
            WSANFlags.bits.OnTimeGetMQ6 = SET;
        }
    #endif
 if (WSANFlags.bits.Autocmr == SET)// Autocmr =1 => gui du lieu len
    {
          /***********quanghoa***********/
          
         //if (TimerCount % TIME_SENDING_PACKET)
       // {
//            TimerCount = CLEAR;
           //#if defined(USE_PTC06)
                WSANFlags.bits.EnableGetDataCMR = SET;
           // #endif
         //}
     }
 

    
    if (WSANFlags.bits.DeviceMode == ActiveMode)//Devicemode = 1 --> Save Energy.
    {
          /***********trongkhanh***********/

         if(TimerCount%CYCLE_SENDING_5M == 0 && CYCLE_SENDING_STATUS == 1){
            #if defined(USE_SHT10)
                WSANFlags.bits.EnableGetDataHTE5M = SET;
            #endif
            }

        if (TimerCount == CYCLE_SENDING && CYCLE_SENDING_STATUS == 1)
        {
            TimerCount = CLEAR;

            //SET get temperature and humidity from SHT10 every (5*CYCLE_SENDING)s
            #if defined(USE_SHT10)
                WSANFlags.bits.EnableGetDataHTE = SET;
            #endif

            //start sampling for conversion to digital
            #if defined(USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
                AD1CON1bits.SAMP = SET;
            #endif

            #if defined(I_AM_ACTOR1) || defined(I_AM_ACTOR2)
                WSANFlags.bits.EnablePingToRE = SET;
            #endif

            
        }

        
        
        //start sampling for conversion to digital. every 5s meassure MQ6 signal
        #if defined(USE_MQ6_V1)
            AD1CON1bits.SAMP = SET;
        #endif
    
    }
    #endif

   
    //re-assigned for PR3:PR2
    PR3 = timer >> 16;
    PR2 = timer & 0xFFFF;
   
    //if you don't want print neighbor of this node, comment the following
    //WSANFlags.bits.PrintNeighborTable = SET;
}

#if defined(USE_MQ6_V1) || defined(USE_WARNING_LOW_POWER)
void _ISR __attribute__((interrupt, auto_psv)) _ADC1Interrupt(void)
{
    IFS0bits.AD1IF = CLEAR;
    //Lay gia tri chuyen doi ADC
    #if defined(USE_MQ6_V1) && defined(USE_WARNING_LOW_POWER)
        switch(WSANFlags.bits.MQ6orVoltage)
        {
            case Power_Mode_ADC:
                Energy_Level = POWER_SUPPLY_BUFF;//lay gia tri dien ap tu zener de suy ra VDD
                AD1CHS = MQ6_MEASURE_CHANNEL;//chuyen sang do mq6
                WSANFlags.bits.MQ6orVoltage = MQ6_Mode_ADC;
                break;

            case MQ6_Mode_ADC:
                if(k == 0)
                {
                    k = 8;
                    Mq6Signal = Mq6Signal >> 3;//chia 8 lay gia tri trung binh
                    AD1CHS = VOLTAGE_MEASURE_CHANNEL;//chuyen sang do voltage
                    #if defined(USE_LED)
                       WSAN_LED = ~WSAN_LED;
                    #endif
                    WSANFlags.bits.MQ6orVoltage = Finish_Convert;
                }
                else
                {
                    #if defined(USE_DEBUG)
                        ConsolePut(k+0x30);
                        printf("\r\n");
                    #endif
                    --k;
                    Mq6Signal = Mq6Signal + MQ6_BUFF;//lay gia tri dien ap tu mq6
                    AD1CON1bits.SAMP = SET;
                }                
                break;

            default:
                break;
        }
    #endif

    #if defined(USE_MQ6_V1) && !defined(USE_WARNING_LOW_POWER)
        if(k == 0)
        {
            k = 8;
            Mq6Signal = Mq6Signal >> 3;//chia 8 lay gia tri trung binh
            #if defined(USE_LED)
                WSAN_LED = ~WSAN_LED;
            #endif
            WSANFlags.bits.CompleteADC = SET;
        }
        else
        {
            #if defined(USE_DEBUG)
                ConsolePut(k+0x30);
                printf("\r\n");
            #endif
            --k;
            Mq6Signal = Mq6Signal + MQ6_BUFF;//lay gia tri dien ap tu mq6
            AD1CON1bits.SAMP = SET;
        }
    #endif

    #if defined(USE_WARNING_LOW_POWER) && !defined(USE_MQ6_V1)
        Energy_Level = POWER_SUPPLY_BUFF;
        WSANFlags.bits.CompleteADC = SET;
    #endif
}
#endif

#if defined(USE_CONTROL_PUMP) || defined(USE_CONTROL_ALARM)
void _ISR __attribute__((interrupt, auto_psv)) _U2RXInterrupt(void)
{
    IFS1bits.U2RXIF = CLEAR;
    StatusActor = U2RXREG;
    if(StatusActor)
        WSANFlags.bits.ActorAckReceive = SET;
}
#endif
#if defined(USE_DEBUG)&& defined(USE_PTC06)
void _ISR __attribute__((interrupt, auto_psv)) _U1RXInterrupt(void)
{
    IFS0bits.U1RXIF = CLEAR;
    data = U1RXREG;
    if(data=='a'){
        Take_photo();
        UART1PutROMString("end");
               }
    if(data=='b'){
        //UART1PrintWord(length_data);
       for(j=0;j<length_data;j++){
        UART1PrintChar(buffer[j]);
        CLRWDT();
            }
    }
    if(data=='c'){
        //UART1PrintWord(length_data);
       for(j=0;j<length_data;j++){
        UART1Put(buffer[j]);
        CLRWDT();
            }        
    }
}
#endif
#if defined (USE_MINI_RADAR)
void _ISR __attribute__((interrupt, auto_psv)) _U1RXInterrupt(void)
{
    IFS0bits.U1RXIF = CLEAR;
    
    i = U1RXREG;
    #if defined(USE_DEBUG)
        ConsolePut(i);
        printf("\r\n");
    #endif
    //receive character W from Mini Radar Board -> detected motion
    if(i == 'W')
    {
        //mradar_count--;
        //if(mradar_count == 0)
        if(WSANFlags.bits.EnableReceiveMW)
        {
            WSANFlags.bits.MicrowaveDetecting = SET;
            WSANFlags.bits.EnableReceiveMW = CLEAR;
            //re-assigned for PR3:PR2
            PR3 = timer >> 16;
            PR2 = timer & 0xFFFF;
            #if defined(USE_DEBUG)
                printf("Khoi tao timer dem thoi gian\r\n");
            #endif
        }
    }
}
#endif

#if defined(USE_PIR)
void _ISR __attribute__((interrupt, auto_psv)) _INT0Interrupt(void)
{
    IFS0bits.INT0IF = CLEAR;
    if(WSANFlags.bits.EnableReceivePIR)
    {
        for(i = 0; i < 200; i++);//eliminate noise
        if(PORTFbits.RF6 == 0)
        {
            WSANFlags.bits.PIRDetecting = SET;
        }
    }
}
#endif

#if defined(USE_MQ6_V2)
void _ISR __attribute__((interrupt, auto_psv)) _INT0Interrupt(void)
{
    IFS0bits.INT0IF = CLEAR;
    if(SET_MQ6_V2 == 1 && WSANFlags.bits.OnTimeGetMQ6 == SET)
    {
//        for(i = 0; i < 100; i++);//eliminate noise
        if(PORTFbits.RF6 == 0)
        {
            WSANFlags.bits.MQ6Warning = SET;
            WSANFlags.bits.OnTimeGetMQ6 = CLEAR;
            Timer_MQ6 = 0;
//            printf("interrupt!!!\r\n");
        }
    }
}
#endif

#ifdef USE_MINI_RADAR
/*********************************************************************
 * Function:     	void CheckMiniRadar()
 *
 * PreCondition:   UART1  ready to use
 *
 * Cluater:         
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        
 *
 * Note:
 ********************************************************************/
BOOL CheckMiniRadar()
{
    unsigned long _i =0;
    BOOL ex =0;
    char Temp;

