vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
    //CLEAR UART1 interrupt
    IEC0bits.U1RXIE = CLEAR;
    IFS0bits.U1RXIF = CLEAR;

    //ping to MiniRadar Board
    UART1Put('R');

    //CLEAR Watchdog Timer to avoid reset system before receive response from MiniRadar Board
    DISABLE_WDT();

    //if don't receive response from MiniRadar Board after time out, break wait
    while((!IFS0bits.U1RXIF)&&(_i <= 1000000)) _i++;

    //if receive (a) message from MiniRadar Board, check it if is 'R' character
    if(IFS0bits.U1RXIF)
    {
        IFS0bits.U1RXIF = CLEAR;
        Temp = U1RXREG;
        if(Temp == 'R') ex = 1;
        else ex = 0;
    }
    else
         ex = 0;

    //Re-SET Watchdog Timer.
    ENABLE_WDT();

    //Re-SET UART1 interrupt
    IEC0bits.U1RXIE = SET;
    IFS0bits.U1RXIF = CLEAR;
    return ex;
}
#endif
/***********quanghoa*************/
#if /*defined(USE_DEBUG)&&*/ defined(USE_PTC06)
// ham thiet lap ban dau
void Initphoto(void){
    //printf("bat dau size\n");
    sendPhotoSize();
    //lenh thiet lap lai size image
    //sendPhotoSize();
    // printf("bat dau ress\n");
    sendCompressRate();
   }
/********************/
// ham chup anh va lay do dai, data anh
void Take_photo(void){
     // printf("bat dau cache\n");
    sendStopPhoto();
    // printf("bat dau pho to\n");
    /**chup anh***/
    sendStartPhoto();
   //  printf("bat dau length\n");
    sendGetLength();
    // printf("bat dau\n");
    length_data=sendGetPhoto(buffer);
   //  printf("end\n");
     UART1PrintWord(length_data);
}
/***************ham gui dia chi mac va do dai anh ve R-EMB**********/
//void Send_MAC_ToRouterEmboard(WORD CMR_Cluster)
//{
//
//        TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0;
//        TxBuffer[TxData++] = (BYTE) (length_data >> 8);
//        TxBuffer[TxData++] = (BYTE) (length_data);
//
//   params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
//    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
//    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;
//
//    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
//    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
//    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;
//
//    //params.APSDE_DATA_request.asduLength; TxData
//    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop
//
////    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
////    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;
//
//    #ifdef I_SUPPORT_SECURITY
//        params.APSDE_DATA_request.TxOptions.Val = SET;
//    #else
//        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
//    #endif
//    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
//    params.APSDE_DATA_request.ClusterId.Val = CMR_Cluster;
//
//    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
//    currentPrimitive = APSDE_DATA_request;
//}

/***************ham gui goi data da duoc cat ve R-EMB *********************/
void Send_IMAGE_ToRouterEmboard(WORD CMR_Cluster)
{    
    WORD j;
    TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0;
    TxBuffer[TxData++] = (BYTE) (length_data >> 8);
    TxBuffer[TxData++] = (BYTE) (length_data);
    TxBuffer[TxData++]=COUNT_PACKET;// gui byte goi thu bao nhieu
    for(j=0;j<80;j++){              //gui goi 80byte
        TxBuffer[TxData++] = buffer[j+COUNT_PACKET*80];
        if(buffer[j+COUNT_PACKET*80-1]==0xFF && buffer[j+COUNT_PACKET*80]==0xD9)break;
    }
    COUNT_PACKET=COUNT_PACKET+1;//tang bien dem goi len 1
       
    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;

    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = CMR_Cluster;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}

void Send_Packet_ToRouterEmboard(WORD CMR_Cluster, BYTE pk)
{
    WORD j;
    TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0;
    TxBuffer[TxData++] = (BYTE) (length_data >> 8);
    TxBuffer[TxData++] = (BYTE) (length_data);
    TxBuffer[TxData++]= pk;// gui byte goi thu bao nhieu
    for(j=0;j<80;j++){              //gui goi 80byte
        TxBuffer[TxData++] = buffer[j+pk*80];
        if(buffer[j+pk*80-1]==0xFF && buffer[j+pk*80]==0xD9)break;
    }

    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;

    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

