vanchinh94/WSAN_SENSOR-2/Retasking/Router_retasking/PIC24FRouter/Router.c
    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = ClusterID;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}

#if defined (TRACE_ROUTE_SUPPORT)
/*********************************************************************
 * Function:        void RouteDrawRequestToNextHop(BYTE MSB_addr, BYTE LSB_addr, BYTE NodeNumber, BYTE *pListOfNode)
 *
 * PreCondition:
 *
 * Cluater:         REQUEST_ROUTE_CLUSTER
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui yeu cau ve tuyen den nut co dia chi mang MSB_addr, LSB_addr
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void RouteDrawRequestToNextHop(BYTE MSB_dest_addr, BYTE LSB_dest_addr, BYTE NodeNumber, BYTE *pListOfNode)
{
	BYTE i;
	NodeNumber ++;
	TxBuffer[TxData++] = MSB_dest_addr;//Dia chi Node dich
	TxBuffer[TxData++] = LSB_dest_addr;
    TxBuffer[TxData++] = NodeNumber;//So node di qua
    for (i = 0; i< NodeNumber - 1; i++) TxBuffer[TxData++]= *pListOfNode;
 	TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0; //Chen them byte0 dia chi MAC cua node   
    for (i = 0; i < ROUTING_TABLE_SIZE-RESERVED_ROUTING_TABLE_ENTRIES; i++ )//Gui den forward Node
            {	
		    GetRoutingEntry(&currentRoutingEntry,pCurrentRoutingEntry);
            if ((MSB_dest_addr == currentRoutingEntry.destAddress.byte.MSB)&&(LSB_dest_addr == currentRoutingEntry.destAddress.byte.LSB)&&(currentRoutingEntry.status == ROUTE_ACTIVE))
                { 
                params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = currentRoutingEntry.nextHop.byte.MSB;
                params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = currentRoutingEntry.nextHop.byte.LSB;
				break;
				}
             }
       
    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = ROUTE_DRAW_REQUEST_CLUSTER;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}
/*********************************************************************
 * Function:        void RouteDrawReply(BYTE NodeNumber, BYTE *pListOfNode)
 *
 * PreCondition:
 *
 * Cluater:         REQUEST_ROUTE_CLUSTER
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Gui yeu cau ve tuyen den nut co dia chi mang MSB_addr, LSB_addr
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void RouteDrawReply(BYTE NodeNumber, BYTE *pListOfNode)
{
	BYTE i;
	NodeNumber ++;
    TxBuffer[TxData++] = NodeNumber;//So node di qua
    for (i = 0; i< NodeNumber - 1; i++) TxBuffer[TxData++]= *pListOfNode;
 	TxBuffer[TxData++] = MAC_LONG_ADDR_BYTE0; //Chen them byte0 dia chi MAC cua node   
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = RouterEmboardAddrMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = RouterEmboardAddrLSB;
    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;//0x02 : Ban tin Unicast, Set che do dia chi mang ( DstAddress) 16 bit va yeu cau co' DstEndPoint
    params.APSDE_DATA_request.SrcEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.DstEndpoint = WSAN_Endpoint;
    params.APSDE_DATA_request.ProfileId.Val = MY_PROFILE_ID;

    //params.APSDE_DATA_request.asduLength; TxData
    params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;//gioi han so hop ma du lieu duoc phep truyen qua, o day la 10 hop

//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_FORCE;
    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
//    params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;

    #ifdef I_SUPPORT_SECURITY
        params.APSDE_DATA_request.TxOptions.Val = SET;
    #else
        params.APSDE_DATA_request.TxOptions.Val = CLEAR;//khong ho tro bao mat
    #endif
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = SET;// Yeu cau ACK tu thiet bi thu
    params.APSDE_DATA_request.ClusterId.Val = ROUTE_DRAW_REPLY_CLUSTER;

    ZigBeeBlockTx();//goi ham nay de ZigbeeIsReady() --> false
    currentPrimitive = APSDE_DATA_request;
}
#endif

/*********************************************************************
 * Function:        void MCUSleep(void)
 *
 * PreCondition:
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Put MCU into Sleep Mode
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void MCUSleep(void)
{//DSCON THANH GHI DIEU KHIEN CHE DO SLEEP
    DSCONbits.DSEN=1;//DEEP SLEEP ENABLE bit
    DSCONbits.DSBOR=1;//PHAT HIEN SU KIEN TRONG MODE SLEEP
    DSCONbits.RELEASE=0;//CONFIG I/O SAU KHI WAKE
    if(DSWAKEbits.DSFLT==1){};//BIT PHAT HIEN LOI
}
/*********************************************************************
 * Function:        void MCUSWake(void)
 *
 * PreCondition:
 *
 * Output:          None
 *
 * Side Effects:
 *
 * Overview:        Put MCU into Sleep Mode
 *
 * Note: By Hoang Anh Son - K53
 ********************************************************************/
void MCUWake(void)
{
  DSWAKEbits.DSINT0=0;//
  DSWAKEbits.DSWDT=1;// WATCHDOG TIMER TIME-OUT TRONG MODE SLEEP
  DSWAKEbits.DSRTCC;
  if(DSWAKEbits.DSFLT==1){};//BIT PHAT HIEN LOI
     DSWAKEbits.DSMCLR =0;  //BIT SU KIEN CUA MCLR
  RCON2bits.VBAT;
}
